In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame({'cat': ['A','A','A','A','A','B','B','B','B','B'],
                   'sales': [10, 20, 30, 40, 50, 1, 2, 3, 4, 5]})

print(df['sales'].quantile(q=0.5, interpolation='nearest'))
print(df['sales'].quantile(0.2, interpolation='nearest'))

5
3

In [10]:

dup_df = pd.DataFrame([1,1,1,1,2,2,2,3,3,4])
dup_df

   0
0  1
1  1
2  1
3  1
4  2
5  2
6  2
7  3
8  3
9  4

In [11]:
dup_df.head()

   0
0  1
1  1
2  1
3  1
4  2

In [12]:
dup_df.take([1,2,5])

   0
1  1
2  1
5  2

In [13]:
dup_df.duplicated()

0    False
1     True
2     True
3     True
4    False
5     True
6     True
7    False
8     True
9    False
dtype: bool

In [14]:
#중복된 요소 제거하고, 유일 값 표시
dup_df.drop_duplicates()

   0
0  1
4  2
7  3
9  4

In [15]:
# 유일한 요소 개수 구하기
len(dup_df) - len(dup_df.drop_duplicates())

6

In [16]:
# 유이일한 요소 배열 반환
dup_df[0].unique()

array([1, 2, 3, 4], dtype=int64)

In [17]:
# 유일한 요소의 개수구하기
# [1,2,3,4], 4개
dup_df.nunique()

0    4
dtype: int64

In [18]:
pd.unique(dup_df[0])

array([1, 2, 3, 4], dtype=int64)

In [19]:
# 요소별 빈도수 구하기
dup_df.value_counts()

1    4
2    3
3    2
4    1
dtype: int64

In [20]:
import pandas as pd

df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [1, 2, 4], 'B': [4, 5, 6]})


print(df1.eq(df2))

       A     B
0   True  True
1   True  True
2  False  True

In [21]:
print(df1.equals(df2))

False

In [22]:
print(df1.ne(df2))
print(df1.lt(df2))
print(df1.ge(df2))

       A      B
0  False  False
1  False  False
2   True  False
       A      B
0  False  False
1  False  False
2   True  False
       A     B
0   True  True
1   True  True
2  False  True

In [23]:
df1.rename(columns={'B': 'C'})

   A  C
0  1  4
1  2  5
2  3  6